// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя)
/* int number = 5; //Тип_данных имя_переменной = значение переменной
int secondnumber = 8;
int result = number * number;
int secondresult = secondnumber * secondnumber;
// Консоль, выведи результат
Console.Write("Значение result = ");
Console.WriteLine(result);
Console.Write("Значение secondresult = ");
Console.WriteLine(secondresult);
Console.WriteLine($"{number} * {number} = {result}");*/
int number = 5;
while (number < 10)
{
    Console.WriteLine(number);
    number++;
}