// Задача 19. Напишите программу, которая принимает на вход
// пятизначное число и проверяет, является ли оно палиндромом (число, которое читается слева направо и справо налево одинаково).

void Example_19()
{
    Console.WriteLine("|    Задача 22     |");
    Console.WriteLine("Введите пятизначное целое число: ");
    int number = Convert.ToInt32(Console.ReadLine());
    if (number < 10000 | number > 100000) Console.WriteLine("Некорректный ввод");
    else
    {

    }
    //Random rand = new Random();
    //int number = rand.Next(10000, 99999);
    //Console.WriteLine(number);



}
Example_19();